var a = 1, b = 1, c, d;
c = ++a; alert(c);           // 2
d = b++; alert(d);           // 1
c = (2 + ++a); alert(c);      // 5
d = (2 + b++); alert(d);      // 4
alert(a);                    // 3
alert(b);                    // 3

/* ++a и подобные команды - преинкремент. Такая команда сначала увеличивает переменную, а затем использует ее.
a++ - постинкремент. Такая команда сначала использует переменную в неизмененном виде, а потом увеличивает.
После завершения такой команды при повторном вызове переменной она будет больше на 1.
